In [1]:
import sqlite3

conn = sqlite3.connect("dummy.db")
cur = conn.cursor()

cur.execute(
    '''
    CREATE TABLE IF NOT EXISTS USERS(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT NOT NULL,
        marks INTEGER NOT NULL)
    '''
)

conn.commit()  # make sure table is saved

In [2]:
cur.execute(
    '''
    INSERT INTO USERS (name, marks) VALUES
    ('satish', 70),
    ('saran', 65),
    ('kamal', 72)
    '''
)
conn.commit()

In [3]:
cur.execute("SELECT marks FROM USERS")
ls_marks = cur.fetchall()
ls_marks

[(70,), (65,), (72,), (70,), (65,), (72,)]

In [4]:
res = [x[0] for x in ls_marks]
sum(res) / len(res)

69.0

In [5]:
import pandas as pd
df = pd.DataFrame(
    data=[
        [35, 21],
        [41, 34],
        [11, 22]
    ],
    columns=['Apples', 'Bananas'],
    index=['2017 Sales', '2018 Sales', '2019 Sales']
)
df

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34
2019 Sales      11       22

In [6]:
pd.DataFrame(
    data = {
        'Apples': [35, 21],
        'Bananas': [41, 34]
    },
    index=['2017 Sales', '2018 Sales']
)

            Apples  Bananas
2017 Sales      35       41
2018 Sales      21       34

In [7]:
pd.read_csv('country_region.csv')

          Country         Region
0   United States  North America
1          Canada  North America
2          Brazil  South America
3       Argentina  South America
4         Germany         Europe
5          France         Europe
6         Nigeria         Africa
7           Egypt         Africa
8           China           Asia
9           India           Asia
10      Australia        Oceania
11    New Zealand        Oceania

Use pip install openpyxl to use the excel formatted file.

In [8]:
pd.read_excel('country_region.xlsx')

          Country         Region
0   United States  North America
1          Canada  North America
2          Brazil  South America
3       Argentina  South America
4         Germany         Europe
5          France         Europe
6         Nigeria         Africa
7           Egypt         Africa
8           China           Asia
9           India           Asia
10      Australia        Oceania
11    New Zealand        Oceania

For a very bigger file we can use the chunksize argument to specify the number of rows or if it's very big like terabytes of data we have to pyspark or something else. And also this returns a different generator like object TextFileReader we have to iterate through the data and process it.

In [9]:
fr = pd.read_csv('country_region.csv', chunksize=2)
for line in fr:
    print(line)

         Country         Region
0  United States  North America
1         Canada  North America
     Country         Region
2     Brazil  South America
3  Argentina  South America
   Country  Region
4  Germany  Europe
5   France  Europe
   Country  Region
6  Nigeria  Africa
7    Egypt  Africa
  Country Region
8   China   Asia
9   India   Asia
        Country   Region
10    Australia  Oceania
11  New Zealand  Oceania

In [11]:
pd.read_json('country_region.json')

          Country         Region
0   United States  North America
1          Canada  North America
2          Brazil  South America
3       Argentina  South America
4         Germany         Europe
5          France         Europe
6         Nigeria         Africa
7           Egypt         Africa
8           China           Asia
9           India           Asia
10      Australia        Oceania
11    New Zealand        Oceania

In [13]:
pd.read_table('country_region.tsv')

          Country         Region
0   United States  North America
1          Canada  North America
2          Brazil  South America
3       Argentina  South America
4         Germany         Europe
5          France         Europe
6         Nigeria         Africa
7           Egypt         Africa
8           China           Asia
9           India           Asia
10      Australia        Oceania
11    New Zealand        Oceania

In [17]:
df = pd.DataFrame(
    { 'col1': [20, 10], 'col2': [40, 30] }
)
df['col1'], df.col1

(0    20
 1    10
 Name: col1, dtype: int64,
 0    20
 1    10
 Name: col1, dtype: int64)

In [39]:
df = pd.DataFrame(
    { 'col1': [20, 10], 'col2': [40, 30] },
    index = ['f', 's']
)
print(df)
print(df.col1.f)
print(df['col1']['f'])
df['col1']['f':], type(df['col1']['f'])
df['col1']['f'] + 7

   col1  col2
f    20    40
s    10    30
20
20

np.int64(27)

In [56]:
df = pd.DataFrame(
    { 'col1': [20, 10], 'col2': [40, 30], 'col3': [60, 50] }
)
df[0:2]
df[['col1', 'col2']]

   col1  col2
0    20    40
1    10    30